archives/2024/Results/Verifications/S2427/point_select/tidb-server-thead-c906.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 8327.94 qps: 8327.94 (r/w/o: 8327.94/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 8662.34 qps: 8662.34 (r/w/o: 8662.34/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 9007.58 qps: 9007.58 (r/w/o: 9007.58/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 8776.81 qps: 8776.81 (r/w/o: 8776.81/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 8329.66 qps: 8329.66 (r/w/o: 8329.66/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 8983.88 qps: 8983.88 (r/w/o: 8983.88/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 8119.25 qps: 8119.25 (r/w/o: 8119.25/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 7694.84 qps: 7694.84 (r/w/o: 7694.84/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 8644.44 qps: 8644.44 (r/w/o: 8644.44/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 9137.59 qps: 9137.59 (r/w/o: 9137.59/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 9214.31 qps: 9214.31 (r/w/o: 9214.31/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 9235.48 qps: 9235.48 (r/w/o: 9235.48/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 9315.80 qps: 9315.80 (r/w/o: 9315.80/0.00/0.00) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 9123.88 qps: 9123.88 (r/w/o: 9123.88/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 9123.71 qps: 9123.71 (r/w/o: 9123.71/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 9095.12 qps: 9095.12 (r/w/o: 9095.12/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 8652.84 qps: 8652.84 (r/w/o: 8652.84/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 9040.45 qps: 9040.45 (r/w/o: 9040.45/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 8613.01 qps: 8613.01 (r/w/o: 8613.01/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 8505.79 qps: 8505.79 (r/w/o: 8505.79/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 8797.30 qps: 8797.30 (r/w/o: 8797.30/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 9156.86 qps: 9156.86 (r/w/o: 9156.86/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 9126.16 qps: 9126.16 (r/w/o: 9126.16/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 9160.99 qps: 9160.99 (r/w/o: 9160.99/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 9244.49 qps: 9244.59 (r/w/o: 9244.59/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 9076.59 qps: 9076.59 (r/w/o: 9076.59/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 9330.51 qps: 9330.41 (r/w/o: 9330.41/0.00/0.00) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 9193.07 qps: 9193.07 (r/w/o: 9193.07/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 9197.48 qps: 9197.48 (r/w/o: 9197.48/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 8730.15 qps: 8730.15 (r/w/o: 8730.15/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 8606.66 qps: 8606.66 (r/w/o: 8606.66/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 7611.83 qps: 7611.83 (r/w/o: 7611.83/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 7950.04 qps: 7950.04 (r/w/o: 7950.04/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 9044.34 qps: 9044.34 (r/w/o: 9044.34/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 8846.18 qps: 8846.18 (r/w/o: 8846.18/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 9114.72 qps: 9114.72 (r/w/o: 9114.72/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 8967.29 qps: 8967.29 (r/w/o: 8967.29/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 9071.50 qps: 9071.50 (r/w/o: 9071.50/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 9185.05 qps: 9185.05 (r/w/o: 9185.05/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 9189.47 qps: 9189.47 (r/w/o: 9189.47/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 9217.90 qps: 9217.90 (r/w/o: 9217.90/0.00/0.00) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 9204.02 qps: 9204.02 (r/w/o: 9204.02/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 9219.66 qps: 9219.66 (r/w/o: 9219.66/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 8403.49 qps: 8403.49 (r/w/o: 8403.49/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 9085.68 qps: 9085.68 (r/w/o: 9085.68/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 8451.72 qps: 8451.72 (r/w/o: 8451.72/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 8478.07 qps: 8478.07 (r/w/o: 8478.07/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 8821.49 qps: 8821.49 (r/w/o: 8821.49/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 9189.05 qps: 9189.05 (r/w/o: 9189.05/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 8969.48 qps: 8969.48 (r/w/o: 8969.48/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 9275.70 qps: 9275.70 (r/w/o: 9275.70/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 9131.54 qps: 9131.64 (r/w/o: 9131.64/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 9073.79 qps: 9073.69 (r/w/o: 9073.69/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 9280.73 qps: 9280.73 (r/w/o: 9280.73/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 9127.80 qps: 9127.80 (r/w/o: 9127.80/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 9145.18 qps: 9145.18 (r/w/o: 9145.18/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 9225.02 qps: 9225.02 (r/w/o: 9225.02/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 9037.79 qps: 9037.79 (r/w/o: 9037.79/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 9083.27 qps: 9083.27 (r/w/o: 9083.27/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 8897.82 qps: 8897.82 (r/w/o: 8897.82/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5345298
        write:                           0
        other:                           0
        total:                           5345298
    transactions:                        5345298 (8908.73 per sec.)
    queries:                             5345298 (8908.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0061s
    total number of events:              5345298

Latency (ms):
         min:                                    0.65
         avg:                                    1.34
         max:                                  303.32
         95th percentile:                        2.52
         sum:                              7189060.86

Threads fairness:
    events (avg/stddev):           445441.5000/760.38
    execution time (avg/stddev):   599.0884/0.03